__author__ = 'Bio'

import sqlite3 as s3


class Data():
    def __init__(self, path):
        self.rows = []
        self.con = s3.connect(path)
        self.cur = self.con.cursor()
        self.cur.execute(
            "CREATE TABLE IF NOT EXISTS Products(id INTEGER PRIMARY KEY, Name TEXT, Price INT, About TEXT, Image TEXT)")
        self.cur.execute(
            "CREATE TABLE IF NOT EXISTS Comments(id INTEGER PRIMARY KEY, App TEXT, Name TEXT, Text TEXT)")

    def __del__(self):
        self.con.close()

    def insert(self, name, price, about, img):
        self.cur.execute("INSERT INTO Products(Name, Price, About, Image) VALUES(?,?,?,?)", (name, price, about, img))

    def select(self, name=None):
        if name:
            self.cur.execute("SELECT * FROM Products WHERE Name LIKE ?", (name,))
            self.rows = self.cur.fetchone()
        else:
            self.cur.execute("SELECT * FROM Products")
            self.rows = self.cur.fetchall()

    def ins_com(self, app, name, text):
        self.cur.execute("INSERT INTO Comments(App, Name, Text) VALUES(?,?,?)", (app, name, text))

    def select_com(self, app):
        self.cur.execute(
            """SELECT *
                FROM
                (
                     SELECT *
                     FROM Comments
                     WHERE App LIKE ?
                     ORDER BY id DESC
                     LIMIT 5
                ) T1
                ORDER BY id DESC""", (app+"",)
        )
        return self.cur.fetchall()

    def find_filter(self, firms, price):
        self.rows = []
        for firm in firms:
            self.cur.execute("""
                SELECT * FROM
                (
                    SELECT * FROM Products
                    WHERE (Price >= ? AND Price <= ?)
                ) WHERE Name LIKE ('%' || ? || '%')
                """, (price[0], price[1], firm)
            )
            self.rows.extend(self.cur.fetchall())

    def find(self, word):
        self.rows = []
        self.cur.execute("""
            SELECT * FROM Products
            WHERE Name LIKE ('%' || ? || '%')
            """, (word,)
        )
        self.rows.extend(self.cur.fetchall())

    def __del__(self):
        self.con.close()


if __name__ == "__main__":
    d = Data("templates/products.db")
    print(d.con)
    try:
        d.insert("""NIKON D800 Black""",
                     6899,
                     str("Давно мрієте про компактну фотокамеру класичного стилю,"
                         " що дозволяє робити знімки як в широкоформатному, так і "
                         "в телескопічному положенні об'єктиву. Модель COOLPIX L340"
                         " з 20-мегапіксельною матрицею відповідає всім заданим умовам"
                         " і має ряд додаткових переваг. Завдяки об'єктиву з потуужним"
                         " 28-кратним оптичним зумом, розширюваним до 56-кратногос допомогою"
                         " функції Dynamic Fine Zoom, камера дозволяє відобразити динаміку"
                         " подій навіть здалеку. Функція динамічного масштабування Fine"
                         " дозволяє отримати вдвічі більше збільшення, ніж при використанні"
                         " максимального оптичного зуму в сторону телефото, і зберегти при"
                         " цьому гранично високу роздільну здатність зображення."),
                     str("/images/products/ph4.jpg"))
        d.insert("""CANON EOS 600D""",
                 4599,
                 str("Відкрийте для себе свободу творчості за допомогою цифрового"
                     " фотоапарата Немає необхідності довго розбиратися зі знімними"
                     " об'єктивами, коли ви знаходитесь на природі або на пляжі: потужний "
                     "об'єктив в 35х оптичним зумом впорається з будь-фотозадачей.Встановлено"
                     " матриця з дозволом 20 мегапікселів. Завдяки їй отримані кадри можна"
                     " використовувати для широкоформатного друку і художнього кадрування."
                     " Природне перенесення кольорів і низький рівень шуму приємно здивують"
                     " навіть досвідчених користувачів.Стабільні і чіткі відеокліпи Full HD"
                     " з високою чіткістю і деталізацією одним дотиком кнопки. Зображення буде"
                     " залишатися стабільним і гладким навіть при зйомці в русі і відзняти."),
                 str("/images/products/ph5.jpg"))
        d.insert("""Samsung ES15 Power""",
                 3499,
                 str("Цифровий фотоапарат серії Coolpix від Nikon оснащений матрицею ПЗС"
                     " з діагоналлю 1 / 2,3 дюйма. Завдяки дозволу 16,1 Мп пристрій здатний"
                     " на якісну і деталізовану зйомку. Об'єктив камери обладнаний 5-кратним"
                     " оптичним зумом, що дозволить чітко зафіксувати віддалені об'єкти."
                     " Фокусна відстань складає 26-130 мм (в еквіваленті плівки - 35 мм). "
                     "Мінімальна дистанція для макрозйомки в ширококутному положенні - 10 см."
                     " Конструкція об'єктиву включає 6 елементів в 5 групах. Діафрагма"
                     " F / 3.2-6.5 і діапазон світлочутливості ISO 80-1600 одиниць забезпечують "
                     "природні і глибокі знімки незалежно від рівня освітленості. Параметри"
                     " витримки варіюються від 1/2000 до 1 с. У режимі «Феєрверк» це значення"
                     " збільшується до 4 с. У пристрої реалізована електронна система придушення "
                     "вібрацій VR, яка компенсує тремтіння камери і запобігає змазування фото і"
                     " відео. Система фокусування передбачає автоматичну установку рівня контрасту."),
                 str("/images/products/ph6.jpg"))
        d.insert("""NIKON Coolpix L840 Purple""",
                     3999,
                     str("Давно мрієте про компактну фотокамеру класичного стилю,"
                         " що дозволяє робити знімки як в широкоформатному, так і "
                         "в телескопічному положенні об'єктиву. Модель COOLPIX L340"
                         " з 20-мегапіксельною матрицею відповідає всім заданим умовам"
                         " і має ряд додаткових переваг. Завдяки об'єктиву з потуужним"
                         " 28-кратним оптичним зумом, розширюваним до 56-кратногос допомогою"
                         " функції Dynamic Fine Zoom, камера дозволяє відобразити динаміку"
                         " подій навіть здалеку. Функція динамічного масштабування Fine"
                         " дозволяє отримати вдвічі більше збільшення, ніж при використанні"
                         " максимального оптичного зуму в сторону телефото, і зберегти при"
                         " цьому гранично високу роздільну здатність зображення."),
                     str("/images/products/ph7.jpg"))
        d.insert("""Samsung D340 X10""",
                 2999,
                 str("Відкрийте для себе свободу творчості за допомогою цифрового"
                     " фотоапарата Немає необхідності довго розбиратися зі знімними"
                     " об'єктивами, коли ви знаходитесь на природі або на пляжі: потужний "
                     "об'єктив в 35х оптичним зумом впорається з будь-фотозадачей.Встановлено"
                     " матриця з дозволом 20 мегапікселів. Завдяки їй отримані кадри можна"
                     " використовувати для широкоформатного друку і художнього кадрування."
                     " Природне перенесення кольорів і низький рівень шуму приємно здивують"
                     " навіть досвідчених користувачів.Стабільні і чіткі відеокліпи Full HD"
                     " з високою чіткістю і деталізацією одним дотиком кнопки. Зображення буде"
                     " залишатися стабільним і гладким навіть при зйомці в русі і відзняти."),
                 str("/images/products/ph8.jpg"))
        d.insert("""Canon IXUS 269 8X""",
                 3999,
                 str("Цифровий фотоапарат серії Coolpix від Nikon оснащений матрицею ПЗС"
                     " з діагоналлю 1 / 2,3 дюйма. Завдяки дозволу 16,1 Мп пристрій здатний"
                     " на якісну і деталізовану зйомку. Об'єктив камери обладнаний 5-кратним"
                     " оптичним зумом, що дозволить чітко зафіксувати віддалені об'єкти."
                     " Фокусна відстань складає 26-130 мм (в еквіваленті плівки - 35 мм). "
                     "Мінімальна дистанція для макрозйомки в ширококутному положенні - 10 см."
                     " Конструкція об'єктиву включає 6 елементів в 5 групах. Діафрагма"
                     " F / 3.2-6.5 і діапазон світлочутливості ISO 80-1600 одиниць забезпечують "
                     "природні і глибокі знімки незалежно від рівня освітленості. Параметри"
                     " витримки варіюються від 1/2000 до 1 с. У режимі «Феєрверк» це значення"
                     " збільшується до 4 с. У пристрої реалізована електронна система придушення "
                     "вібрацій VR, яка компенсує тремтіння камери і запобігає змазування фото і"
                     " відео. Система фокусування передбачає автоматичну установку рівня контрасту."),
                 str("/images/products/ph9.jpg"))
        d.insert("""NIKON Coolpix 700 Pink""",
                     2799,
                     str("Давно мрієте про компактну фотокамеру класичного стилю,"
                         " що дозволяє робити знімки як в широкоформатному, так і "
                         "в телескопічному положенні об'єктиву. Модель COOLPIX L340"
                         " з 20-мегапіксельною матрицею відповідає всім заданим умовам"
                         " і має ряд додаткових переваг. Завдяки об'єктиву з потуужним"
                         " 28-кратним оптичним зумом, розширюваним до 56-кратногос допомогою"
                         " функції Dynamic Fine Zoom, камера дозволяє відобразити динаміку"
                         " подій навіть здалеку. Функція динамічного масштабування Fine"
                         " дозволяє отримати вдвічі більше збільшення, ніж при використанні"
                         " максимального оптичного зуму в сторону телефото, і зберегти при"
                         " цьому гранично високу роздільну здатність зображення."),
                     str("/images/products/ph10.jpg"))
        d.insert("""Samsung HMX-880 Scheduler""",
                 8599,
                 str("Відкрийте для себе свободу творчості за допомогою цифрового"
                     " фотоапарата Немає необхідності довго розбиратися зі знімними"
                     " об'єктивами, коли ви знаходитесь на природі або на пляжі: потужний "
                     "об'єктив в 35х оптичним зумом впорається з будь-фотозадачей.Встановлено"
                     " матриця з дозволом 20 мегапікселів. Завдяки їй отримані кадри можна"
                     " використовувати для широкоформатного друку і художнього кадрування."
                     " Природне перенесення кольорів і низький рівень шуму приємно здивують"
                     " навіть досвідчених користувачів.Стабільні і чіткі відеокліпи Full HD"
                     " з високою чіткістю і деталізацією одним дотиком кнопки. Зображення буде"
                     " залишатися стабільним і гладким навіть при зйомці в русі і відзняти."),
                 str("/images/products/ph11.jpg"))
        #
    finally:
        d.con.commit()
    d.select('NIKON Coolpix L340 Black')
    print(d.rows)
    d.ins_com("CANON PowerShot SX410 IS Black", "sdgsdrgdrsghsdrgag", "rg aqregtae gasrgw rehgwearsh ywyhwyt wq4t")
    d.con.commit()
    print(d.select_com("CANON PowerShot SX410 IS Black"))

    d.find('can')
    print(d.rows)
